(function() {
    const logo = document.querySelector(".m-siteLogo__link"),
        styleElement = document.createElement("style"),
        styleSheet = `
        .logo_text{
            stroke-width: 1;
            fill-rule:evenodd;
            stroke:#000;
            stroke-dasharray: 80;
            opacity:0;
            transition: opacity 0.5s,fill 0.5s,stroke-dashoffset 2s ;
            stroke-dashoffset: 80;
        }
        .logo_text.logo_text-visible{
            fill:#000;
            opacity:1;
        }
        .logo_text.logo_text-stroke{
            fill:transparent;
            stroke-dashoffset: 0;
        }
        .logo_text.logo_text-filled{
            stroke:transparent;
            fill:#000;
            transition: all 1s;
        }
        `,
        logoSvg = `
        <svg xmlns="http://www.w3.org/2000/svg" width="98.723" height="24.256" viewBox="0 0 98.723 24.256">
          <g id="logo" transform="translate(147 -611.834)">
            <g class="logo_part logo_icon" transform="translate(-147 611.834)">
              <path d="M9.224,10.681H6.364a1.82,1.82,0,0,1-.624-.07,1.227,1.227,0,0,1,0-2.324,1.868,1.868,0,0,1,.625-.068H8.218V6.363a1.82,1.82,0,0,1,.07-.624A1.2,1.2,0,0,1,9.45,4.906a1.21,1.21,0,0,1,1.162.833,1.851,1.851,0,0,1,.069.624V9.223a2.349,2.349,0,0,1-.035.5,1.266,1.266,0,0,1-.919.919,2.349,2.349,0,0,1-.5.035Zm9.189,10.507H3.069V7.672a.6.6,0,0,1,.181-.441L7.23,3.25a.6.6,0,0,1,.442-.181H18.413ZM.745,5.4A2.419,2.419,0,0,0,.017,6.893Q0,7.078,0,7.264V22.548a3.406,3.406,0,0,0,.017.381,1.545,1.545,0,0,0,1.31,1.31,3.42,3.42,0,0,0,.381.017H19.775a3.39,3.39,0,0,0,.381-.017,1.545,1.545,0,0,0,1.31-1.31,3.169,3.169,0,0,0,.017-.381V1.707a3.177,3.177,0,0,0-.017-.382A1.545,1.545,0,0,0,20.157.017,3.258,3.258,0,0,0,19.775,0H7.264c-.139,0-.278.009-.373.018A2.415,2.415,0,0,0,5.4.745Z" transform="translate(0 0)" fill="#41c9b4" fill-rule="evenodd"/>
            </g>
            <path class="logo_part logo_text-visible logo_text logo_text-n" d="M18.323-30H13.99v-7.827a3.078,3.078,0,0,0-.528-2,1.738,1.738,0,0,0-1.395-.623,2.7,2.7,0,0,0-1.219.313,3.877,3.877,0,0,0-1.124.86,3.921,3.921,0,0,0-.772,1.251V-30H4.62V-44.051h3.9v2.4a5.345,5.345,0,0,1,1.354-1.414,6.035,6.035,0,0,1,1.869-.894,8.225,8.225,0,0,1,2.3-.307,4.433,4.433,0,0,1,2.234.494,3.4,3.4,0,0,1,1.3,1.294,5.207,5.207,0,0,1,.6,1.72,11.263,11.263,0,0,1,.149,1.8Z" transform="translate(-121.116 662.151)" fill="transparent"/>
            <path class="logo_part logo_text-visible logo_text logo_text-o" d="M9.626-29.726a8.416,8.416,0,0,1-3.236-.587,6.959,6.959,0,0,1-2.4-1.6,6.856,6.856,0,0,1-1.476-2.321,7.615,7.615,0,0,1-.5-2.748,7.69,7.69,0,0,1,.5-2.775A6.856,6.856,0,0,1,3.993-42.08a6.959,6.959,0,0,1,2.4-1.6,8.416,8.416,0,0,1,3.236-.587,8.314,8.314,0,0,1,3.223.587,6.988,6.988,0,0,1,2.383,1.6,7.034,7.034,0,0,1,1.489,2.321,7.51,7.51,0,0,1,.515,2.775,7.437,7.437,0,0,1-.515,2.748,7.034,7.034,0,0,1-1.489,2.321,6.988,6.988,0,0,1-2.383,1.6A8.314,8.314,0,0,1,9.626-29.726ZM6.457-36.983a4.079,4.079,0,0,0,.42,1.893A3.177,3.177,0,0,0,8-33.828a2.967,2.967,0,0,0,1.625.447,2.922,2.922,0,0,0,1.611-.46,3.143,3.143,0,0,0,1.124-1.275,4.129,4.129,0,0,0,.406-1.866,4.192,4.192,0,0,0-.406-1.893,3.049,3.049,0,0,0-1.124-1.262,2.986,2.986,0,0,0-1.611-.447A2.967,2.967,0,0,0,8-40.138a3.177,3.177,0,0,0-1.124,1.262A4.079,4.079,0,0,0,6.457-36.983Z" transform="translate(-100.008 662.473)" fill="transparent"/>
            <path class="logo_part logo_text-visible logo_text logo_text-t" d="M11.892-39.8q-.6.244-1.313.487a11.1,11.1,0,0,1-1.5.393,8.272,8.272,0,0,1-1.544.149,5.346,5.346,0,0,1-1.99-.36,2.96,2.96,0,0,1-1.435-1.188,4.019,4.019,0,0,1-.528-2.188v-7.313H1.764V-53.1H3.578v-4.522H7.911V-53.1h2.9v3.277h-2.9v5.8a1.249,1.249,0,0,0,.352.993,1.317,1.317,0,0,0,.894.3,3.371,3.371,0,0,0,.988-.162,5.967,5.967,0,0,0,.907-.352Z" transform="translate(-79.204 671.201)" fill="transparent"/>
            <path class="logo_part logo_text-visible logo_text logo_text-t" d="M9.653-29.726A8.459,8.459,0,0,1,6.43-30.3a7.171,7.171,0,0,1-2.4-1.566,6.707,6.707,0,0,1-1.5-2.289,7.312,7.312,0,0,1-.515-2.718,7.561,7.561,0,0,1,.907-3.683,7.025,7.025,0,0,1,2.613-2.686,7.858,7.858,0,0,1,4.116-1.024,7.851,7.851,0,0,1,4.1,1.013A6.923,6.923,0,0,1,16.342-40.6a7.319,7.319,0,0,1,.894,3.559,6.532,6.532,0,0,1-.041.733q-.041.36-.068.626H6.62a3.111,3.111,0,0,0,.528,1.553,2.88,2.88,0,0,0,1.151.961,3.474,3.474,0,0,0,1.489.329,3.791,3.791,0,0,0,1.828-.46,2.494,2.494,0,0,0,1.178-1.246l3.683,1.029a6.13,6.13,0,0,1-1.53,1.963,7.389,7.389,0,0,1-2.329,1.34A8.623,8.623,0,0,1,9.653-29.726ZM6.511-38.337h6.174a3.538,3.538,0,0,0-.515-1.486,2.773,2.773,0,0,0-1.083-.982A3.2,3.2,0,0,0,9.6-41.154a3.18,3.18,0,0,0-1.5.349,2.8,2.8,0,0,0-1.07.982A3.538,3.538,0,0,0,6.511-38.337Z" transform="translate(-65.512 660.861)" fill="transparent"/>
          </g>
        </svg>
        `;
    start();
    async function start() {
        logo.children[0].remove(); //元のロゴ消す
        logo.innerHTML = logoSvg; //ロゴをsvgタグに変える
        const textPaths = Array.from(document.querySelectorAll(".logo_text")); //テキストを配列で取得する
        styleElement.innerText = styleSheet; //stylesheetに中身入れる
        logo.append(styleElement); //styleshhetをdom上に追加
        await timer(1000); //ちょっと待機して
        textPaths.forEach((e) => e.classList.remove("logo_text-visible")); //一旦テキストを消す
        await timer(1000); //アニメーション開始まである程度時間をかけて
        await textPaths.reduce((p, e) => {
            return p.then(() => {
                e.classList.add("logo_text-visible");
                e.classList.add("logo_text-stroke");
                return timer(500)
            });
        }, Promise.resolve()); //一文字づつ、順番にアニメーションさせてい
        await timer(1500); //ちょっと待機して
        textPaths.forEach((e) => e.classList.add("logo_text-filled")); //元の状態に戻す。
    }
    async function timer(time) { //タイマー
        return new Promise((r) => {
            setTimeout(() => {
                r();
            }, time);
        })
    }
})();